CalculationAPI/app/controllers/api/cards_controller.rb

  def index
    if(params.has_key? :card_id)
      @card = Card.where(:card_id=>params[:card_id])
      render json:@card

    else
      @cards = Card.all
---
SELECT "cards".* FROM "cards"  WHERE "cards"."card_id" IS NULL
SELECT "cards".* FROM "cards"

    def set_Card
      @Card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards"  WHERE "cards"."card_id" IS NULL