CalculationAPI/app/controllers/api/deck_cards_controller.rb

  def index
    @cards = DeckCard.all
---
SELECT "deck_cards".* FROM "deck_cards"  WHERE "deck_cards"."card_id" = 'h1'

  def top
    @card = DeckCard.last
---
SELECT  "deck_cards".* FROM "deck_cards"   ORDER BY "deck_cards"."id" DESC LIMIT 1

  def create
    @Deck_card = DeckCard.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])
---
INSERT INTO "deck_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "d2"], ["suit", "d"], ["value", "2"]]

  def destroy
    if(params[:card_id].blank?)
      @Deck_cards = DeckCard.all
      @Deck_cards.destroy
---
SELECT  "deck_cards".* FROM "deck_cards"  WHERE "deck_cards"."card_id" = 'd10' LIMIT 1
DELETE FROM "deck_cards" WHERE "deck_cards"."id" = ?  [["id", 48]]