CalculationAPI/app/controllers/api/point3_cards_controller.rb

SELECT "point3_cards".* FROM "point3_cards"
---
  def index
    if(params.has_key? :card_id)
      @card = Point3Card.where(:card_id=>params[:card_id])
      render json:@card

    else
      @cards = Point3Card.all

INSERT INTO "point3_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "s3"], ["suit", "s"], ["value", "3"]]
---
  def create
    @Point3Card = Point3Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])

SELECT "point3_cards".* FROM "point3_cards"
DELETE FROM "point3_cards" WHERE "point3_cards"."id" = ?  [["id", 1]]
---
  def destroy
    if(params[:card_id].blank?)
      @Point3Cards = Point3Card.all
      @Point3Cards.destroy