CalculationAPI/app/controllers/api/point2_cards_controller.rb

SELECT "point2_cards".* FROM "point2_cards"
---
  def index
    if(params.has_key? :card_id)
      @card = Point2Card.where(:card_id=>params[:card_id])
      render json:@card

    else
      @cards = Point2Card.all

SELECT  "point2_cards".* FROM "point2_cards"   ORDER BY "point2_cards"."id" DESC LIMIT 1
---
  def top
    @card = Point2Card.last

INSERT INTO "point2_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "d4"], ["suit", "d"], ["value", "4"]]
---
  def create
    @Point2Card = Point2Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])

SELECT "point2_cards".* FROM "point2_cards"
DELETE FROM "point2_cards" WHERE "point2_cards"."id" = ?  [["id", 1]]
---
  def destroy
    if(params[:card_id].blank?)
      @Point2Cards = Point2Card.all
      @Point2Cards.destroy