CalculationAPI/app/controllers/api/point4_cards_controller.rb

  def top
    @card = Point4Card.last
---
SELECT  "point4_cards".* FROM "point4_cards"   ORDER BY "point4_cards"."id" DESC LIMIT 1

  def create
    @Point4Card = Point4Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])
---
INSERT INTO "point4_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "s4"], ["suit", "s"], ["value", "4"]]

  def destroy
    if(params[:card_id].blank?)
      @Point4Cards = Point4Card.all
      @Point4Cards.destroy
---
SELECT "point4_cards".* FROM "point4_cards"
DELETE FROM "point4_cards" WHERE "point4_cards"."id" = ?  [["id", 1]]