CalculationAPI/app/controllers/api/point1_cards_controller.rb

SELECT "point1_cards".* FROM "point1_cards"
---
  def index
    if(params.has_key? :card_id)
      @card = Point1Card.where(:card_id=>params[:card_id])
      render json:@card

    else
      @cards = Point1Card.all

SELECT  "point1_cards".* FROM "point1_cards"   ORDER BY "point1_cards"."id" DESC LIMIT 1
---
  def top
    @card = Point1Card.last

INSERT INTO "point1_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "s6"], ["suit", "s"], ["value", "6"]]
---
  def create
    @Point1Card = Point1Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])

SELECT "point1_cards".* FROM "point1_cards"
DELETE FROM "point1_cards" WHERE "point1_cards"."id" = ?  [["id", 1]]
---
  def destroy
    if(params[:card_id].blank?)
      @Point1Cards = Point1Card.all
      @Point1Cards.destroy