CalculationAPI/app/controllers/api/waste4_cards_controller.rb

SELECT "waste4_cards".* FROM "waste4_cards"
DELETE FROM "waste4_cards"
---
  def destroy
    if(params[:card_id].blank?)
      @Waste4Cards = Waste4Card.all
      @Waste4Cards.destroy