CalculationAPI/app/controllers/api/waste3_cards_controller.rb

  def create
    @Waste3Card = Waste3Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])
---
INSERT INTO "waste3_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "h5"], ["suit", "h"], ["value", "5"]]

  def destroy
    if(params[:card_id].blank?)
      @Waste3Cards = Waste3Card.all
      @Waste3Cards.destroy
---
SELECT "waste3_cards".* FROM "waste3_cards"
DELETE FROM "waste3_cards"