CalculationAPI/app/controllers/api/waste1_cards_controller.rb

  def index
    if(params.has_key? :card_id)
      @card = Waste1Card.where(:card_id=>params[:card_id])
      render json:@card

    else
      @cards = Waste1Card.all
---
SELECT "waste1_cards".* FROM "waste1_cards"

  def top
    @card = Waste1Card.last
---
SELECT  "waste1_cards".* FROM "waste1_cards"   ORDER BY "waste1_cards"."id" DESC LIMIT 1

  def create
    @Waste1Card = Waste1Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])
---
INSERT INTO "waste1_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "c12"], ["suit", "c"], ["value", "12"]]

  def destroy
    if(params[:card_id].blank?)
      @Waste1Cards = Waste1Card.all
      @Waste1Cards.destroy
---
SELECT "waste1_cards".* FROM "waste1_cards"
DELETE FROM "waste1_cards" WHERE "waste1_cards"."id" = ?  [["id", 1]]