CalculationAPI/app/controllers/api/waste2_cards_controller.rb

SELECT "waste2_cards".* FROM "waste2_cards"
---
  def index
    if(params.has_key? :card_id)
      @card = Waste2Card.where(:card_id=>params[:card_id])
      render json:@card

    else
      @cards = Waste2Card.all

INSERT INTO "waste2_cards" ("card_id", "suit", "value") VALUES (?, ?, ?)  [["card_id", "c4"], ["suit", "c"], ["value", "4"]]
---
 def create
    @Waste2Card = Waste2Card.create(:card_id => params[:card_id], :value => params[:value], :suit => params[:suit])

SELECT "waste2_cards".* FROM "waste2_cards"
DELETE FROM "waste2_cards" WHERE "waste2_cards"."id" = ?  [["id", 1]]
---
  def destroy
    if(params[:card_id].blank?)
      @Waste2Cards = Waste2Card.all
      @Waste2Cards.destroy