app/views/game_play/index.erb

SELECT "deck_cards".* FROM "deck_cards"
---
      <div id="DECK" class="ui-widget-content stack">
        <%= image_tag($cards.last.id+'.png', alt: $cards.last.id, :class => 'card' ) %>